# GetImportIFCOptions Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImportIFCOptions..::..GetImportIFCOptions Method
ImportIFCOptions Class See Also
---
Returns the current Revit instance's ImportIFCOptions.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ImportIFCOptions GetImportIFCOptions()
```

Visual Basic
---
```text
Public Shared Function GetImportIFCOptions As ImportIFCOptions
```

Visual C++
---
```text
public:
static ImportIFCOptions^ GetImportIFCOptions()
```

# ### Return Value
The ImportIFCOptions for the current Revit instance.
# See Also
ImportIFCOptions Class
Autodesk.Revit.DB Namespace